<?php
// +----------------------------------------------------------------------
// | Copyright (c) 2019  http://www.sycit.cn
// +----------------------------------------------------------------------
// | Author: Peter.Zhang  <hyzwd@outlook.com>
// +----------------------------------------------------------------------
// | Date:   2019/9/22
// +----------------------------------------------------------------------
// | Title:  lang.php
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 多语言设置
// +----------------------------------------------------------------------

use think\facade\Env;

return [
    // 默认语言
    'default_lang'          => Env::get('lang.default_lang', 'zh-cn'),
    // 全局语言包目录 (app.DIRECTORY_SEPARATOR.lang) 首尾不含'/'，为空不加载
    'default_lang_path'     => 'lang',
    // 允许的语言列表
    'allow_lang_list'       => [],
    // 多语言自动侦测变量名
    'detect_var'            => 'lang',
    // 是否使用Cookie记录
    'use_cookie'            => true,
    // 多语言cookie变量
    'cookie_var'            => 'think_lang',
    // 扩展语言包
    'extend_list'           => [],
    // Accept-Language转义为对应语言包名称
    'accept_language'       => [
        'zh-hans-cn'    => 'zh-cn',
    ],
    // 是否支持语言分组
    'allow_group'           => false,
];